XSOVAX/XSOVAX-stm32_-_LCD_ILI9225_SD_card/src/main.c
/**
 * @file main.c
 * @brief Основной файл проекта STM32F103 + microSDHC + FatFS
 * 
 * Функции:
 * - Инициализация системы (RCC, UART, SPI)
 * - Работа с microSD-картой через FatFS
 * - Запись и чтение файлов
 * - Сканирование файлов по расширению
 * - Вывод информации через UART
 */

#include "stm32f1xx.h"
#include <stdio.h>
#include "USART.h"
#include "TIMER.h"
#include "SPI.h"
#include "file_work.h"
#include "SD_card.h"
#include "ILI9225.h"
#include "EXTI.h"
#include "menu.h"


//#define BUF_READ_PICTURE (15 /* строчек */ * LCD_HEIGHT * 3 /* байта на цвет */)
//static uint8_t picture[BUF_READ_PICTURE];


/**
 * @brief Инициализация тактирования системы
 * 
 * Настройки:
 * - Тактирование от HSE (8 МГц)
 * - PLL: 8 МГц * 9 = 72 МГц
 * - APB1 = 36 МГц (для периферии)
 * - APB2 = 72 МГц (для периферии)
 * - Flash latency = 2 (для 72 МГц)
 */
static void system_rcc_init(void) {
    // Включаем HSE
    RCC->CR |= RCC_CR_HSEON;
    while (!(RCC->CR & RCC_CR_HSERDY)) {}

    // Настройка Flash latency (2 WS для 72 МГц)
    FLASH->ACR |= FLASH_ACR_LATENCY_2;
    while ((FLASH->ACR & FLASH_ACR_LATENCY) != FLASH_ACR_LATENCY_2) {}

    // Настройка предделителя APB1 (деление на 2 ? 36 МГц)
    RCC->CFGR |= RCC_CFGR_PPRE1_DIV2;

    // Настройка PLL: 8 МГц * 9 = 72 МГц
    RCC->CFGR &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMULL);
    RCC->CFGR |= RCC_CFGR_PLLSRC | RCC_CFGR_PLLMULL9;

    // Включаем PLL
    RCC->CR |= RCC_CR_PLLON;
    while (!(RCC->CR & RCC_CR_PLLRDY)) {}

    // Переключаемся на PLL
    RCC->CFGR &= ~RCC_CFGR_SW;
    RCC->CFGR |= RCC_CFGR_SW_PLL;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL) {}
}


/**
 * @brief Основная функция программы
 */
int main(void) {
    RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;
    GPIOC->CRH |= GPIO_CRH_MODE13 | GPIO_CRH_CNF13_0;
    for (volatile int i = 0; i < 5; i++){
        GPIOC->BSRR |= GPIO_BSRR_BS13; 
        for (volatile int i = 0; i < 50000; i++);
        GPIOC->BSRR |= GPIO_BSRR_BR13; 
        for (volatile int i = 0; i < 50000; i++);
    }


    system_rcc_init();
    // Инициализурем USART1 для логов
    uart_init();
    uart_puts("Project init!\r\n");
    TIM3_init();
    SysTick_init();
    spi_init();
 
    // Инициализация дисплея
    ILI9225_init();
    Delay_ms(100);


    menu_redraw_full();
    EXTI_init();
    
    
    /*
    sd_init();
    uart_puts("\r\n=== FatFS Test ===\r\n");
    // Инициализация файловой системы
    FRESULT res = filesystem_init();
    while (res != FR_OK) {
        uart_puts("Filesystem init failed: ");
        print_hex(res);
        uart_puts("\r\n");
        SPI_devices[0].deactivate();
        Delay_ms(1000);
        res = filesystem_init();
    }
    

    uart_puts("Filesystem mounted!\r\n");

    // Вывод всех файлов 
    list_files(".*");

    */
    
    
    //ILI9225_write(ENTRY_MODE, (0x1000) | (0b011 << 3));
    
    /*
    // Установка ориентации (011)
    ILI9225_write(ENTRY_MODE, (0x1000) | (0b011 << 3));

    file_read("xp_.bmp", picture, BUF_READ_PICTURE);

    drawString8x8(10, 10, "HELLO WORLD", COLOR_TOMATO, 0);
    drawString8x8(10, 10 + 9, "HELLO WORLD", COLOR_TOMATO, 0);
    drawString8x8(10, 10 + 9 * 2, "HELLO WORLD", COLOR_TOMATO, 0);
    drawString8x8(10, 40, "HELLO WORLD", COLOR_TOMATO, 1);
    drawString8x8(10, 40 + 9, "HELLO WORLD", COLOR_TOMATO, 1);
    drawString8x8(10, 40 + 9 * 2, "HELLO WORLD", COLOR_TOMATO, 1);
    drawString8x8(10, 150, "HELLO WORLD", COLOR_TOMATO, 0);
    drawString8x8(10, 150 + 9, "HELLO WORLD", COLOR_TOMATO, 0);
    drawString8x8(10, 150 + 9 * 2, "HELLO WORLD", COLOR_TOMATO, 1);
    drawString8x8(10, 150 + 9 * 3, "HELLO WORLD", COLOR_TOMATO, 0);
    */

    //char buf[50];
    while(1){

    }
}

